In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

Empty DataFrame
Columns: []
Index: []

In [3]:
# single list

sample_list = ['apple', 'banana', 'orange']
df = pd.DataFrame(sample_list, columns = ['Fruit'])
df

    Fruit
0   apple
1  banana
2  orange

In [4]:
# using list

sample_lists = [['Kim', 100, 'middle'],
               ['Lee', 200, 'low'],
               ['Park', 150, 'high']]

col_list = ['name', 'number', 'location']

df1 = pd.DataFrame(sample_lists, columns=col_list)
df1

   name  number location
0   Kim     100   middle
1   Lee     200      low
2  Park     150     high

In [5]:
# using list2

name_list = ['Kim', 'Lee', 'Park']
number_list = [100, 200, 150]
location_list = ['middle', 'low', 'high']
sum_list = [name_list, number_list, location_list]
col_list = ['name', 'number', 'location']

df2 = pd.DataFrame(np.swapaxes(sum_list, 0, 1), columns=col_list)
df2

   name number location
0   Kim    100   middle
1   Lee    200      low
2  Park    150     high

In [6]:
# using list3

name_list = ['Kim', 'Lee', 'Park']
number_list = [100, 200, 150]
location_list = ['middle', 'low', 'high']

col_list = ['name', 'number', 'location']

df3 = pd.DataFrame(list(zip(name_list, number_list, location_list)), columns=col_list)
df3

   name  number location
0   Kim     100   middle
1   Lee     200      low
2  Park     150     high

In [7]:
# using dictionary

student_dict = {'name': ['Kim', 'Lee', 'Park'],
                'number': [100, 200, 150],
                'location': ['middle', 'low', 'high']}
student_df = pd.DataFrame(student_dict)
student_df

   name  number location
0   Kim     100   middle
1   Lee     200      low
2  Park     150     high

In [8]:
# add columns using list

add_list = ['green', 'red', 'yellow']
student_df['color'] = add_list
student_df

   name  number location   color
0   Kim     100   middle   green
1   Lee     200      low     red
2  Park     150     high  yellow